app/Controllers/Category.php

    public function index()
    {
        $model = model(CategoryModel::class);

        $data = [
            'category_list' => $model->findAll(),
            'title'         => 'Category Management',
        ];
---
SELECT *
FROM `category`

    public function update($id = null)
    {
        helper('form');

        if ($id === null) {
            throw new PageNotFoundException('Cannot update the item: ID missing.');
        }

        $model = model(CategoryModel::class);
        $categoryItem = $model->find($id);
---
SELECT *
FROM `category`
WHERE `category`.`id` = '8'

    public function updateSave($id)
    {
        helper('form');

        $data_form = $this->request->getPost(['category']);

        // La regla de unicidad excluye el ID que se está actualizando.
        $validationRules = [
            'category' => "required|max_length[100]|min_length[2]|is_unique[category.category,id,{$id}]",
        ];

        // Si la validación falla, recargamos el formulario llamando al método 'update' (GET)
        if (! $this->validateData($data_form + ['id' => $id], $validationRules)) {
            return $this->update($id);
        }

        $post = $this->validator->getValidated();
        $model = model(CategoryModel::class);

        $model->save([
            'id'       => $id,
            'category' => $post['category'],
        ]);
---
UPDATE `category` SET `category` = 'Thrilleer'
WHERE `category`.`id` IN ('8')