app/Controllers/News.php

    public function update($id)
{
        helper('form');

        if ($id == null) {
            throw new PageNotFoundException('Cannot update the item');
        }

        $model = model(NewsModel::class);
        $categoryModel = model(CategoryModel::class);
        if($model->where('id',$id)->find()){
            $data = [
                'news' => $model->where('id',$id)->first(),
                'title' => 'Update item',
                'category' => $categoryModel->findAll(),
---
SELECT *
FROM `category`