app/Controllers/News.php

    public function new()
    {
        helper('form');
        $model_cat = model (CategoryModel::class);
        if($data['category'] = $model_cat->findAll()){
---
SELECT *
FROM `category`

    public function create()
    {
        helper('form');

        $data = $this->request->getPost(['title', 'body','id_category']);

        // Checks whether the submitted data passed the validation rules.
        if (! $this->validateData($data, [
            'title' => 'required|max_length[255]|min_length[3]',
            'body'  => 'required|max_length[5000]|min_length[10]',
            'id_category' => 'required'
        ])) {
            // The validation fails, so returns the form.
            return $this->new();
        }

        // Gets the validated data.
        $post = $this->validator->getValidated();

        $model = model(NewsModel::class);

        $model->save([
            'title' => $post['title'],
            'slug'  => url_title($post['title'], '-', true),
            'body'  => $post['body'],
            'id_category' => $post['id_category'],
        ]);
---
INSERT INTO `news` (`title`, `slug`, `body`, `id_category`) VALUES ('Prueba 3', 'prueba-3', 'Hoafafadadad', '4')

    public function update($id)
{
        helper('form');

        if ($id == null) {
            throw new PageNotFoundException('Cannot update the item');
        }

        $model = model(NewsModel::class);
        if($model->where('id',$id)->find()){
            $data = [
                'news' => $model->where('id',$id)->first(),
                'title' => 'Update item',
            ];
---
SELECT *
FROM `news`
WHERE `id` = '12'
SELECT *
FROM `news`
WHERE `id` = '12'
 LIMIT 1

    public function updatedItem($id)
{
        helper('form');
        $data_form = $this->request->getPost(['title', 'body']);// name form

        // Checks whether the submitted data passed the validation rules.
        if (! $this->validateData($data_form, [
            'title' => 'required|max_length[255]|min_length[3]',
            'body'  => 'required|max_length[5000]|min_length[10]',
        ])) {
            // The validation fails, so returns the form.
            return $this->update($id);
        }

        // Gets the validated data.
        $post = $this->validator->getValidated();

        $model = model(NewsModel::class);

        $model->save([
            'id'    => $id,
            'title' => $post['title'],
            'slug'  => url_title($post['title'], '-', true),
            'body'  => $post['body'],
        ]);
---
UPDATE `news` SET `title` = 'Pesadilla 2', `slug` = 'pesadilla-2', `body` = 'Omega Studios saca un teaser de Pesadilla en Navidad 2 ', `id_category` = '8'
WHERE `news`.`id` IN ('14')