app/Models/NewsModel.php

    public function getNews($slug = false)
    {
        if ($slug === false) {
            $sql = $this->select('news.*,category.category');
            $sql = $this->join('category','news.id_category=category.id');
            return $this->findAll();
            return $sql;
        }
            $sql = $this->select('news.*,category.category');
            $sql = $this->join('category','news.id_category=category.id');
            return $this->where(['slug' => $slug]);
            $sql = $this->first();
---
SELECT *
FROM `news`
SELECT *
FROM `news`
WHERE `slug` = 'abcabcab'
 LIMIT 1
SELECT `news`.*, `category`.`category`
FROM `news`
JOIN `category` ON `news`.`id_category` = `category`.`id`